{
  "status": "active",
  "date_created": "2022-11-24T09:55:11-08:00",
  "date_updated": "2022-11-24T09:55:11-08:00",
  "active_incidents": [
    {
      "id": 1157,
      "date_created": "2022-11-23T19:58:17-08:00",
      "date_updated": "2022-11-24T09:55:11-08:00",
      "title": "Issues with search in Slack",
      "type": "incident",
      "status": "active",
      "url": "https://status.slack.com/2022-11/66b446a099f855d7",
      "services": [
        "Search"
      ],
      "notes": [
        {
          "date_created": "2022-11-24T09:55:11-08:00",
          "body": "Progress is looking good, but we’re not quite at the finish line. The work continues as we get closer to resolving this issue for you. Stay tuned, we’ll post another update in 30 minutes. Thanks for your patience."
        },
        {
          "date_created": "2022-11-24T09:30:45-08:00",
          "body": "No new updates to share at this point, but we are still working away to get things back in order for you. We apologize for the continued trouble."
        },
        {
          "date_created": "2022-11-24T08:59:15-08:00",
          "body": "The work is continuing towards a fix and we are slowly seeing improvements. We aren’t out of the woods just yet, so we will keep you updated in another 30 minutes on how we’re doing with our investigation. Thanks for sticking with us."
        },
        {
          "date_created": "2022-11-24T08:28:44-08:00",
          "body": "While we don't have additional news to share, we are continuing to work through this issue and making progress. Our apologies for the ongoing disruption. We are working hard to fix this as soon as we can."
        },
        {
          "date_created": "2022-11-24T07:59:24-08:00",
          "body": "As part of the ongoing issue users are experiencing with search, we've found that users may also experience difficulty when trying to view their sent messages in the \"Drafts & sent\" tab. We're still actively working towards a solution, and we'll have another update for you in 30 minutes. Thank you for your patience."
        },
        {
          "date_created": "2022-11-24T07:25:33-08:00",
          "body": "We've identified some possible solutions for the ongoing search issues users may be experiencing and are continuing to work towards a fix. We'll be back with another update in 30 minutes, and we apologize for any inconvenience this is causing."
        },
        {
          "date_created": "2022-11-24T06:54:12-08:00",
          "body": "While we don't have any new information to share about the ongoing search issues since our last update, we are still actively working on addressing this issue and will continue to provide updates every 30 minutes as we investigate further. Thank you for your patience."
        },
        {
          "date_created": "2022-11-24T06:25:35-08:00",
          "body": "We've found that searching for messages and files may be slow, and searching for members/groups may fail. Additionally, any recent changes (~7 hours) to channels/files will not appear in searches or the Admin Dashboard. We'll continue to keep you posted every 30 minutes as we continue our investigation."
        },
        {
          "date_created": "2022-11-24T05:51:48-08:00",
          "body": "Our investigation is still ongoing but we're focused on getting message, file and recently added member searches back to normal. We'll continue to share updates every 30 minutes. We apologise for the continued trouble."
        },
        {
          "date_created": "2022-11-24T05:21:58-08:00",
          "body": "No additional news to share just yet regarding searching messages, files and recently added members, but we're focused on getting things back to normal as quickly as we can. We will share an update in the next 30 minutes. Thank you again for your patience as we work towards a fix."
        },
        {
          "date_created": "2022-11-24T04:52:24-08:00",
          "body": "We're still actively investigating this issue regarding message search, files search, and searching for members and groups recently added to the workspace. We don't have any new information to share at this time. Thanks for sticking with us as we continue to work towards a fix."
        },
        {
          "date_created": "2022-11-24T04:19:13-08:00",
          "body": "Message search is slow for all customers, and returning incomplete/partial data for EKM customers. Files search is not working for most customers. Searching for members or user groups added to the workspace over the last 3-5 hours is also impacted. We're still working to fix this as fast as we can. Apologies for the disruption to your work."
        },
        {
          "date_created": "2022-11-24T03:48:29-08:00",
          "body": "Message search is slow for all customers, and returning incomplete/partial data for EKM customers. Files search is not working for most customers. Searching for members added to the workspace over the last 3-5 hours is also impacted. We're still working to fix this as fast as we can. Apologies for the disruption to your work."
        },
        {
          "date_created": "2022-11-24T03:01:19-08:00",
          "body": "Message search is slow for all customers, and returning incomplete/partial data for EKM customers. Files search is not working for most customers. We're still working to fix this as fast as we can. Apologies for the disruption to your work."
        },
        {
          "date_created": "2022-11-24T02:29:10-08:00",
          "body": "Message search is slow for all customers, and returning incomplete/partial data for EKM customers. Files search is not working for most customers. We're still working to fix this as fast as we can. Apologies for the disruption to your work."
        },
        {
          "date_created": "2022-11-24T01:48:50-08:00",
          "body": "Message search is slow for all customers, and returning partial data for EKM customers. Files search is not working for most customers. We're working to fix this as fast as we can. Apologies for the disruption to your work."
        },
        {
          "date_created": "2022-11-24T00:18:47-08:00",
          "body": "Some customers may be experiencing issues with the search in Slack. We're working to fix this as fast as we can. Apologies for the disruption to your work."
        },
        {
          "date_created": "2022-11-23T23:46:47-08:00",
          "body": "Some customers may be experiencing search issues in Slack. We're very sorry for the disruption, and we're working to resolve this as fast as we can."
        },
        {
          "date_created": "2022-11-23T23:09:57-08:00",
          "body": "We're still working to resolve the search issues. We'll share another update as soon as we have more information. Thank you for bearing with us."
        },
        {
          "date_created": "2022-11-23T22:26:22-08:00",
          "body": "Our work on the search issue is still ongoing at this time. We’ll be back with another update in 30 minutes."
        },
        {
          "date_created": "2022-11-23T21:56:41-08:00",
          "body": "We're still working to resolve the issues with search. We don't have any new information to share at this stage, but we'll provide another update in 30 minutes."
        },
        {
          "date_created": "2022-11-23T21:27:02-08:00",
          "body": "We have restored functionality to many of the affected features, including sending and receiving messages, huddles, and workflows. \r\n\r\nWe are still investigating some issues with search in Slack, and we apologise for the continued disruption. We'll be back with an update in 30 minutes."
        },
        {
          "date_created": "2022-11-23T20:51:59-08:00",
          "body": "We are seeing further signs of improvement, but we are still monitoring the situation and working to completely restore all affected functionality. \r\n\r\nWe'll share another update in 30 minutes or as soon as we can confirm the issue has been fully resolved, whichever is soonest."
        },
        {
          "date_created": "2022-11-23T20:28:40-08:00",
          "body": "Customers may also be experiencing trouble with huddles and workflows. However, we are beginning to see steady improvements as we work to resolve this issue.\r\n\r\nWe’ll continue to provide updates every 30 minutes."
        },
        {
          "date_created": "2022-11-23T19:58:17-08:00",
          "body": "Some customers may be experiencing issues loading content or sending new messages. We are investigating and we're very sorry for the disruption. \r\n\r\nWe'll be back with an update in 30 minutes or as soon as we have more news to share."
        }
      ]
    }
  ]
}
