{
  "status": "active",
  "date_created": "2023-12-19T19:37:06-08:00",
  "date_updated": "2023-12-19T19:37:06-08:00",
  "active_incidents": [
    {
      "id": 1287,
      "date_created": "2023-12-19T15:56:51-08:00",
      "date_updated": "2023-12-19T19:37:06-08:00",
      "title": "Users seeing blurred file unfurls",
      "type": "incident",
      "status": "active",
      "url": "https://status.slack.com/2023-12/7f05f584fa98cf7c",
      "services": [
        "Files"
      ],
      "notes": [
        {
          "date_created": "2023-12-19T19:37:06-08:00",
          "body": "We're continuing to work towards a fix and will provide an update when this is completely resolved. \r\n\r\nIn the meantime and as a workaround, if the image remains blurry, please expand the image and Slack will load the full size version."
        },
        {
          "date_created": "2023-12-19T18:47:43-08:00",
          "body": "We have identified the cause of images being blurry in Slack and customers can now upload and preview new images without issue.\r\n\r\nWe are still continuing to work on regenerating the previews of older affected images.\r\n\r\nWe will provide an update when functionality is fully restored. Thank you for bearing with us in the meantime."
        },
        {
          "date_created": "2023-12-19T17:37:46-08:00",
          "body": "Customers have reported seeing blurred images within Slack until clicking the preview option. It's also been reported that PDF files are not downloading as the correct file type.\r\n\r\nOur engineers are in the testing stage and are reverting some items in the back-end, which has lead to them seeing small improvements with file unfurl behaviour.\r\n\r\nWe will provide further updates once our engineers have a resolution in progress. We're sorry for the disruption."
        },
        {
          "date_created": "2023-12-19T17:05:52-08:00",
          "body": "Customers have reported seeing blurred images within Slack until clicking the preview option. It's also been reported that PDF files are not downloading as the correct file type.\r\n\r\nOur engineers are in the process of investigating  the root cause and are working hard to resolve this for users.\r\n\r\nWe will provide further updates once our engineers have a resolution in progress. We're sorry for the disruption."
        },
        {
          "date_created": "2023-12-19T16:26:45-08:00",
          "body": "Further to reports about blurred images in Slack, we're also receiving reports on issues with downloading and viewing PDF files.\r\n\r\nWe're currently reviewing the scope of impact to see what customers could be affected. We will provide further updates once we have more details to share. We're sorry for the disruption."
        },
        {
          "date_created": "2023-12-19T15:56:51-08:00",
          "body": "We're receiving reports about blurred images in Slack. The image does display as expected after clicking the image preview.\r\n\r\nWe're on the case and will provide another update once we have more details to share. We're sorry for the disruption."
        }
      ]
    }
  ]
}
