{
  "status": "active",
  "date_created": "2021-01-04T17:18:15-08:00",
  "date_updated": "2021-01-04T17:18:15-08:00",
  "active_incidents": [
    {
      "id": 932,
      "date_created": "2021-01-04T12:12:54-08:00",
      "date_updated": "2021-01-04T17:18:15-08:00",
      "title": "Trouble with Google Calendar and Outlook Calendar",
      "type": "incident",
      "status": "active",
      "url": "https://status.slack.com/2021-01/eb968a2103d010bb",
      "services": [
        "Apps/Integrations/APIs"
      ],
      "notes": [
        {
          "date_created": "2021-01-04T17:18:15-08:00",
          "body": "You should now be able to reply to notification emails delivered after 4:45 p.m PST.\r\n\r\nWe are still working to bring the calendar apps fully back online. We'll return with more information as soon as we have news to share.\r\n\r\nThank you for bearing with us."
        },
        {
          "date_created": "2021-01-04T16:00:00-08:00",
          "body": "Setting up a new email forwarding rule right now may also be affected by the email notifications issue. Our team is continuing to investigate this. \r\n\r\nWe're close to resolving the issue with the calendar apps, and we'll provide an update as soon as we have one."
        },
        {
          "date_created": "2021-01-04T14:50:50-08:00",
          "body": "Users who've joined a workspace and been invited to a workspace should now be receiving email notifications successfully. However, they won't be able to reply to the emails.\r\n\r\nThe issues with Google Calendar and Outlook Calendar are still being worked on. We'll be back once we have some more information."
        },
        {
          "date_created": "2021-01-04T13:47:32-08:00",
          "body": "We're closer to getting Google Calendar working as expected, but we're not at a resolution yet. We're also continuing to work to resolve the trouble with Outlook Calendar and email notifications."
        },
        {
          "date_created": "2021-01-04T12:46:49-08:00",
          "body": "For users who've joined a workspace, email notifications should be delivered. However, these users won't be able to reply to the emails. \r\n\r\nFor users who've been invited to a workspace, but haven't joined, email notifications won't be sent at this time. \r\n\r\nWe'll be back once we have more information about the trouble with the calendars and email notifications."
        },
        {
          "date_created": "2021-01-04T12:12:54-08:00",
          "body": "Google Calendar and Outlook Calendar aren't working as expected, and some email notifications (e.g. a notification of a new direct message in Slack) are failing to send. We're working to resolve this issue, and we're sorry for the trouble."
        }
      ]
    }
  ]
}
