{
  "status": "active",
  "date_created": "2022-10-13T13:34:28-07:00",
  "date_updated": "2022-10-13T13:34:28-07:00",
  "active_incidents": [
    {
      "id": 1151,
      "date_created": "2022-10-13T06:39:53-07:00",
      "date_updated": "2022-10-13T13:34:28-07:00",
      "title": "Some users are experiencing issues loading Slack, including Threads, Saved items, notifications, API hyperlinks, and group DMs/channels",
      "type": "incident",
      "status": "active",
      "url": "https://status.slack.com/2022-10/d2fb7d99fe53f228",
      "services": [
        "Connections",
        "Messaging",
        "Notifications",
        "Apps/Integrations/APIs"
      ],
      "notes": [
        {
          "date_created": "2022-10-13T13:34:28-07:00",
          "body": "We continue investigating this issue. No additional information to share just yet, but we’ll keep you posted as soon we have an update."
        },
        {
          "date_created": "2022-10-13T13:02:39-07:00",
          "body": "Some users might be able to see the Threads view, but they may experience slowness or trouble loading certain threads within that view. We continue investigating this issue closely and will provide updates as soon as we know more. We apologize for the disruption to your work day."
        },
        {
          "date_created": "2022-10-13T12:30:21-07:00",
          "body": "We're actively working on this issue, but we don't have new information to share at the moment. We appreciate your patience while we get things back to normal."
        },
        {
          "date_created": "2022-10-13T12:02:50-07:00",
          "body": "We're observing significant improvement with notifications, accessing channels/DMs, saved items and API hyperlinks. We're still investigating the issue with loading threads and we'll provide an update as soon as we have news to share. Thank you for your continued patience as we work towards a more ideal solution."
        },
        {
          "date_created": "2022-10-13T11:31:10-07:00",
          "body": "No additional news to share just yet, but we’re focused on getting things back to normal as quickly as we can. We apologize for the continued trouble."
        },
        {
          "date_created": "2022-10-13T10:59:11-07:00",
          "body": "Our investigation is still ongoing at this time. We've discovered that this issue may also be impacting some users' notifications. Thank you for checking in and we'll be back with another update."
        },
        {
          "date_created": "2022-10-13T10:12:33-07:00",
          "body": "We’re still actively investigating this issue, but we don’t have any new information to share at this time. Thanks for sticking with us as we continue to work towards a fix."
        },
        {
          "date_created": "2022-10-13T08:53:54-07:00",
          "body": "We're still actively investigating this issue. We'll provide another update as soon as we have more information to share."
        },
        {
          "date_created": "2022-10-13T08:01:31-07:00",
          "body": "We're still actively investigating this issue. In addition to threads, some users are experiencing issues loading some channels, adding users to group DMs and also seeing their Saved section empty. We'll provide another update as soon as we have more information to share."
        },
        {
          "date_created": "2022-10-13T07:03:11-07:00",
          "body": "We are currently seeing issues with hyperlinks posted by APIs not rendering on the Desktop app. We will continue to investigate this further and we’ll share any additional information as we know more. We appreciate your patience in the meantime."
        },
        {
          "date_created": "2022-10-13T06:39:53-07:00",
          "body": "Some users may be having trouble with loading Slack Threads. Additionally, some users may experience their Thread badge notifications not clearing correctly. We are sorry for this inconvenience and are actively investigating. We will continue to share additional details as we know more."
        }
      ]
    }
  ]
}
