{
  "status": "active",
  "date_created": "2022-06-07T15:13:33-07:00",
  "date_updated": "2022-06-07T15:13:33-07:00",
  "active_incidents": [
    {
      "id": 1101,
      "date_created": "2022-06-07T12:17:36-07:00",
      "date_updated": "2022-06-07T15:13:33-07:00",
      "title": "Trouble inviting existing workspace users to private channels",
      "type": "incident",
      "status": "active",
      "url": "https://status.slack.com/2022-06/cf2f30a6e0e0447c",
      "services": [],
      "notes": [
        {
          "date_created": "2022-06-07T15:13:33-07:00",
          "body": "Our investigation is still ongoing at this time. We’ll be back with another update in 30 minutes."
        },
        {
          "date_created": "2022-06-07T14:30:17-07:00",
          "body": "No additional news to share just yet, but we’re focused on getting things back to normal as quickly as we can. We apologize for the continued trouble."
        },
        {
          "date_created": "2022-06-07T14:05:12-07:00",
          "body": "We don’t have any new updates to share at this time. Thanks for standing by while we continue to investigate."
        },
        {
          "date_created": "2022-06-07T13:26:02-07:00",
          "body": "We’re still actively investigating this issue, but we don’t have any new information to share at this time. Thanks for sticking with us as we continue to work towards a fix."
        },
        {
          "date_created": "2022-06-07T12:52:43-07:00",
          "body": "We’re still actively investigating this issue. We’ve found that the cause of the problem stems from incorrectly showing desired invited users as not belonging to the same workspace as the channel. The users in fact do belong to the right workspace. We’ll provide another update as soon as we have more information to share."
        },
        {
          "date_created": "2022-06-07T12:17:36-07:00",
          "body": "Some users on Enterprise Grid may be running into trouble inviting existing workspace users to private channels. We will let you know as soon as we know more. We appreciate your patience in the meantime."
        }
      ]
    }
  ]
}
