{
  "status": "active",
  "date_created": "2021-12-07T17:52:29-08:00",
  "date_updated": "2021-12-07T17:52:29-08:00",
  "active_incidents": [
    {
      "id": 1039,
      "date_created": "2021-12-07T08:42:22-08:00",
      "date_updated": "2021-12-07T17:52:29-08:00",
      "title": "Trouble with certain Slack features",
      "type": "incident",
      "status": "active",
      "url": "https://status.slack.com/2021-12/f756fef8e8c0c05b",
      "services": [
        "Posts/Files",
        "Calls",
        "Apps/Integrations/APIs",
        "Connections"
      ],
      "notes": [
        {
          "date_created": "2021-12-07T17:43:17-08:00",
          "body": "We believe the issue should now be resolved for all customers. If you continue to have any trouble, please let us know via feedback@slack.com"
        },
        {
          "date_created": "2021-12-07T16:25:43-08:00",
          "body": "We're starting to see certain features recover, while others are still behaving unexpectedly. We'll be back with another update in roughly two hours unless the issue is resolved for all affected services sooner. Thank you for hanging in there!"
        },
        {
          "date_created": "2021-12-07T13:48:00-08:00",
          "body": "The investigation into this issue and resolving it remains a priority. Please continue to check our status site for any new developments or changes to this issue. We’ll be back with another update in two hours, unless new information becomes available before then. We thank you for your continued patience and hope to have things working as soon as we can."
        },
        {
          "date_created": "2021-12-07T13:15:00-08:00",
          "body": "Our investigation of the issue is still ongoing at this time. We’ll be back with another update as soon as we can. Thank you for your continued patience while we work to resolve this."
        },
        {
          "date_created": "2021-12-07T12:44:00-08:00",
          "body": "We are continuing to investigate and monitor issues with some of our features. Thank you for your patience while we work to resolve this."
        },
        {
          "date_created": "2021-12-07T12:16:00-08:00",
          "body": "We are continuing to investigate issues with certain features. Thank you for your patience as we work on bringing things back online."
        },
        {
          "date_created": "2021-12-07T11:44:49-08:00",
          "body": "We have determined that workflows, Huddles/calls, posts/files, and email ingestion are the most heavily affected here. We are continuing to work on getting back up and running as quickly as possible. Thank you for bearing with us in the meantime."
        },
        {
          "date_created": "2021-12-07T10:59:58-08:00",
          "body": "We are continuing to investigate issues with some of our features. Thank you for your patience as we do our best to bring things back online."
        },
        {
          "date_created": "2021-12-07T10:44:50-08:00",
          "body": "We are continuing to await more information on upstream issues. Huddles and Calls continue to be most affected. Thank you for your patience as we await a fix."
        },
        {
          "date_created": "2021-12-07T10:17:45-08:00",
          "body": "We are continuing to monitor ongoing issues with several Slack features. An upstream issue may have been identified and we are awaiting a fix. We will keep this site updated as we know more."
        },
        {
          "date_created": "2021-12-07T09:48:13-08:00",
          "body": "We continue to investigate the ongoing issues with several Slack features. We'll follow up when we have more information or in 30 minutes. Thanks for bearing with us."
        },
        {
          "date_created": "2021-12-07T09:15:05-08:00",
          "body": "We're still investigating the ongoing issues with several Slack features. There's no additional information to share just yet, but we'll follow up in 30 minutes. Thanks for bearing with us."
        },
        {
          "date_created": "2021-12-07T08:42:22-08:00",
          "body": "Some users are experiencing issues with several Slack functions currently, including Huddles, email integrations, and file uploads. We are currently investigating and will provide an update in 30 minutes."
        }
      ]
    }
  ]
}
