{
  "status": "active",
  "date_created": "2020-10-16T08:03:57-07:00",
  "date_updated": "2020-10-16T08:03:57-07:00",
  "active_incidents": [
    {
      "id": 915,
      "date_created": "2020-10-16T05:33:01-07:00",
      "date_updated": "2020-10-16T08:03:57-07:00",
      "title": "Degraded performance and connectivity issues",
      "type": "incident",
      "status": "active",
      "url": "https://status.slack.com/2020-10/3e2253fb0e2f1b7c",
      "services": [
        "Connections",
        "Messaging",
        "Link Previews",
        "Calls",
        "Search"
      ],
      "notes": [
        {
          "date_created": "2020-10-16T08:03:57-07:00",
          "body": "Most users should now be able to connect but may still run into issues with degraded performance. Thanks for your patience as we continue to look into it."
        },
        {
          "date_created": "2020-10-16T07:39:20-07:00",
          "body": "We’re continuing to investigate the degraded performance. Users may have issues sending messages, APIs or general slowness on Slack. We are still investigating, and we’ll let you know where we’re at in 30 minutes."
        },
        {
          "date_created": "2020-10-16T07:03:15-07:00",
          "body": "We're still investigating the cause of the performance issues that users may be facing. We appreciate you bearing with us and we'll keep you updated as we have more news."
        },
        {
          "date_created": "2020-10-16T06:33:01-07:00",
          "body": "We don't have any new information to share at the moment. We'll be back with an update as soon as we do. Thank you for your patience."
        },
        {
          "date_created": "2020-10-16T06:04:55-07:00",
          "body": "No additional news to share at this stage, but we’re focused on getting things back to normal as quickly as possible. We’ll be back with another update in 30 minutes."
        },
        {
          "date_created": "2020-10-16T05:33:01-07:00",
          "body": "Some users are struggling to connect to Slack, or facing trouble with the app operating slowly. We are currently investigating, and apologise for the inconvenience caused."
        }
      ]
    }
  ]
}
