{
  "status": "active",
  "date_created": "2021-12-22T08:35:20-08:00",
  "date_updated": "2021-12-22T08:35:20-08:00",
  "active_incidents": [
    {
      "id": 1049,
      "date_created": "2021-12-22T04:58:37-08:00",
      "date_updated": "2021-12-22T08:35:20-08:00",
      "title": "Trouble with connectivity and other services",
      "type": "incident",
      "status": "active",
      "url": "https://status.slack.com/2021-12/a17eae991fdc437d",
      "services": [
        "Messaging",
        "Posts/Files"
      ],
      "notes": [
        {
          "date_created": "2021-12-22T08:35:20-08:00",
          "body": "We don’t have any further information to share at this moment. We apologize for the trouble and thank you for patience while we investigate the root cause of this issue."
        },
        {
          "date_created": "2021-12-22T08:06:07-08:00",
          "body": "Less than 1% of customers are experiencing trouble with sending messages, editing messages, loading threads, applying reactions and uploading files. We're still investigating and we'll post another update in 30 minutes."
        },
        {
          "date_created": "2021-12-22T07:35:45-08:00",
          "body": "While we’re seeing improvements, we are continuing our investigation. Currently, customers may still be experiencing trouble with sending and editing messages, reacting to messages, and attaching files. Thank you for your continued patience as we work through resolving this."
        },
        {
          "date_created": "2021-12-22T07:06:00-08:00",
          "body": "We’re still investigating the issue with file uploads, but we don’t have any new information to share at this time. Thanks for sticking with us as we continue to work towards a fix. We will post another update in 30 minutes."
        },
        {
          "date_created": "2021-12-22T06:35:00-08:00",
          "body": "We’re seeing improvements with most services that were affected earlier while the issues with file uploads are ongoing. We’re continuing to investigate and will post our next update in 30 minutes."
        },
        {
          "date_created": "2021-12-22T05:58:12-08:00",
          "body": "No additional news to share at this time, but we’re focused on getting things back to normal as quickly as we can. We apologize for the continued trouble. We’ll be back with another update in the next 30 minutes."
        },
        {
          "date_created": "2021-12-22T05:28:03-08:00",
          "body": "We are working hard to resolve this connectivity issue and we will update our status site as regularly as possible to keep your informed on our progress."
        },
        {
          "date_created": "2021-12-22T04:58:37-08:00",
          "body": "We are experiencing issues with file uploads, message editing, and other services. We're currently investigating the issue and will provide a status update once we have more information."
        }
      ]
    }
  ]
}
