{
  "status": "active",
  "date_created": "2023-06-06T01:43:52-07:00",
  "date_updated": "2023-06-06T01:43:52-07:00",
  "active_incidents": [
    {
      "id": 1225,
      "date_created": "2023-06-05T00:18:47-07:00",
      "date_updated": "2023-06-06T01:43:52-07:00",
      "title": "Some files may not be unfurling as expected",
      "type": "incident",
      "status": "active",
      "url": "https://status.slack.com/2023-06/6cb0bb4f227a82e8",
      "services": [],
      "notes": [
        {
          "date_created": "2023-06-06T01:43:52-07:00",
          "body": "Thank you for your continued patience while our team investigated this further. We have identified the issue and will provide another update once this has been completely resolved."
        },
        {
          "date_created": "2023-06-05T18:08:21-07:00",
          "body": "Thank you for bearing with us as we investigated. We identified the issue and all new file uploads are now expected to generate thumbnails. We’re sorry for the disruption we brought to your day."
        },
        {
          "date_created": "2023-06-05T13:57:33-07:00",
          "body": "We've identified the cause of this issue with file previews and we're working on getting a fix out as soon as possible. We'll be back once we have another update to share."
        },
        {
          "date_created": "2023-06-05T08:51:54-07:00",
          "body": "We are still investigating issues that some users may experience with unfurling when uploading files to Slack. We'll provide another update as soon as we have more details to share."
        },
        {
          "date_created": "2023-06-05T05:06:33-07:00",
          "body": "We’re still investigating issues some users may experience with unfurling when uploading files to Slack. No additional information to share just yet, but we’ll keep you posted as soon we have an update."
        },
        {
          "date_created": "2023-06-05T00:18:47-07:00",
          "body": "Users may be experiencing issues with unfurling when uploading files to Slack. We are looking into this issue and will provide another update as soon as we have more details to share. Thank you for bearing with us in the meantime."
        }
      ]
    }
  ]
}
