{
  "status": "active",
  "date_created": "2020-10-16T10:37:01-07:00",
  "date_updated": "2020-10-16T10:37:01-07:00",
  "active_incidents": [
    {
      "id": 915,
      "date_created": "2020-10-16T05:33:01-07:00",
      "date_updated": "2020-10-16T10:37:01-07:00",
      "title": "Degraded performance and connection issues",
      "type": "incident",
      "status": "active",
      "url": "https://status.slack.com/2020-10/3e2253fb0e2f1b7c",
      "services": [
        "Calls",
        "Messaging",
        "Search",
        "Link Previews",
        "Apps/Integrations/APIs",
        "Posts/Files",
        "Workspace/Org Administration",
        "Login/SSO",
        "Notifications",
        "Connections"
      ],
      "notes": [
        {
          "date_created": "2020-10-16T10:37:01-07:00",
          "body": "We're continuing to work towards a full resolution on our end. At this time, customers should still be seeing little to no impact. We believe things should remain operational and we'll check back in an hour or sooner if anything changes."
        },
        {
          "date_created": "2020-10-16T10:05:04-07:00",
          "body": "We've made some improvements on our end, and customers should be experiencing little to no impact now. The issue is not resolved, but our team is working to bring things into a controlled state while investigating."
        },
        {
          "date_created": "2020-10-16T09:38:15-07:00",
          "body": "We're continuing to investigate the degraded performance. Although we're seeing some error rates improve, we're not at a resolution just yet.\r\nWe apologize for this inconvenience and will continue to post updates every 30 minutes."
        },
        {
          "date_created": "2020-10-16T09:14:47-07:00",
          "body": "Users may once again have trouble connecting to Slack and are experiencing significantly degraded performance. Our team is still on the case and we will keep you posted as soon as we have more information to share."
        },
        {
          "date_created": "2020-10-16T08:33:53-07:00",
          "body": "We are still investigating and apologize that we don't have a firm update to share as of yet. Please know that all hands are on deck and we're doing all that we can to get things up and running."
        },
        {
          "date_created": "2020-10-16T08:03:57-07:00",
          "body": "Most users should now be able to connect but may still run into issues with degraded performance. Thanks for your patience as we continue to look into it."
        },
        {
          "date_created": "2020-10-16T07:39:20-07:00",
          "body": "We’re continuing to investigate the degraded performance. Users may have issues sending messages, or experience API failures or general slowness. We are still investigating, and we’ll let you know where we’re at in 30 minutes."
        },
        {
          "date_created": "2020-10-16T07:03:15-07:00",
          "body": "We're still investigating the cause of the performance issues that users may be facing. We appreciate you bearing with us and we'll keep you updated as we have more news."
        },
        {
          "date_created": "2020-10-16T06:33:01-07:00",
          "body": "We don't have any new information to share at the moment. We'll be back with an update as soon as we do. Thank you for your patience."
        },
        {
          "date_created": "2020-10-16T06:04:55-07:00",
          "body": "No additional news to share at this stage, but we’re focused on getting things back to normal as quickly as possible. We’ll be back with another update in 30 minutes."
        },
        {
          "date_created": "2020-10-16T05:33:01-07:00",
          "body": "Some users are struggling to connect to Slack, or facing trouble with the app operating slowly. We are currently investigating, and apologise for the inconvenience caused."
        }
      ]
    }
  ]
}
