{
  "status": "active",
  "date_created": "2022-04-20T09:48:27-07:00",
  "date_updated": "2022-04-20T09:48:27-07:00",
  "active_incidents": [
    {
      "id": 1083,
      "date_created": "2022-04-19T20:46:43-07:00",
      "date_updated": "2022-04-20T09:48:27-07:00",
      "title": "Trouble with SCIM deactivating users",
      "type": "incident",
      "status": "active",
      "url": "https://status.slack.com/2022-04/0f465d87b7bda153",
      "services": [
        "Login/SSO"
      ],
      "notes": [
        {
          "date_created": "2022-04-20T09:48:27-07:00",
          "body": "We are continuing to monitor the situation and verify that all affected users are reactivated. We're working on restoring group membership and impacted integrations. We'll be back once we have another update to share."
        },
        {
          "date_created": "2022-04-20T08:46:16-07:00",
          "body": "The team is still ensuring that all affected users are reactivated. While we are continuing to work on restoring group membership and impacted integrations, we appreciate your patience."
        },
        {
          "date_created": "2022-04-20T07:43:55-07:00",
          "body": "We are verifying that all affected users are now reactivated. Our team will now begin work on restoring group membership and impacted integrations. We appreciate your patience while we work to get this resolved."
        },
        {
          "date_created": "2022-04-20T04:44:40-07:00",
          "body": "We're still doing our best to restore all affected users and will share new updates here as soon as we have them.\r\n\r\nWe appreciate your continued patience while we work to get this resolved."
        },
        {
          "date_created": "2022-04-19T23:59:21-07:00",
          "body": "We appreciate your patience as our team continues to work to restore all affected users.\r\n\r\nWe will keep you posted as soon as we have further updates to share."
        },
        {
          "date_created": "2022-04-19T23:47:14-07:00",
          "body": "Our team is currently working on restoring all affected users.\r\n\r\nWe’ll be back once we have another update to share. Thank you for your patience as we continue to work towards a fix."
        },
        {
          "date_created": "2022-04-19T22:34:31-07:00",
          "body": "Our team have now identified all affected users and workspaces. We're still monitoring the situation, and we'll report back with more information in 30 minutes. Thank you for holding tight while we work on this."
        },
        {
          "date_created": "2022-04-19T21:51:28-07:00",
          "body": "We've identified the root cause of this issue, and SCIM events should now be working as expected. We are actively investigating remediation for affected customers. \r\n\r\nThank you for your patience while we look into this. We'll share another update in 30 minutes."
        },
        {
          "date_created": "2022-04-19T20:46:43-07:00",
          "body": "We’re investigating an issue with SCIM deactivating users, and SCIM updates not working as expected. We’re looking into the cause and will provide more information as soon as it's available."
        }
      ]
    }
  ]
}
