{
  "status": "active",
  "date_created": "2022-12-14T05:58:07-08:00",
  "date_updated": "2022-12-14T05:58:07-08:00",
  "active_incidents": [
    {
      "id": 1163,
      "date_created": "2022-12-14T00:35:09-08:00",
      "date_updated": "2022-12-14T05:58:07-08:00",
      "title": "Some users having trouble playing videos",
      "type": "incident",
      "status": "active",
      "url": "https://status.slack.com/2022-12/ddd9879de59fd9d1",
      "services": [
        "Posts/Files"
      ],
      "notes": [
        {
          "date_created": "2022-12-14T05:58:07-08:00",
          "body": "Our team is working hard to resolve the issue that some customers are experiencing when trying to play videos. In the meantime, downloading videos to your device will enable them to be played locally, or you can click the three dots beside the video to open it in a new window. Sorry for any inconvenience."
        },
        {
          "date_created": "2022-12-14T05:28:12-08:00",
          "body": "We're still actively investigating the issue that some customers are experiencing with playing videos. Apologies for the trouble with this. As a workaround in the meantime, you can either download videos to play them locally on your device, or right-click on the video to open it in a new window. Thank you for your continued patience."
        },
        {
          "date_created": "2022-12-14T04:53:05-08:00",
          "body": "We apologize for the trouble that some customers are experiencing with playing videos. We are working hard to fix this issue as soon as possible. As a workaround, you can download videos to your device and play them locally until this is resolved."
        },
        {
          "date_created": "2022-12-14T04:23:23-08:00",
          "body": "Some customers are having trouble playing videos at the moment, and our team is actively working to resolve this. A workaround is to download videos in order to play them locally. Sorry for any inconvenience."
        },
        {
          "date_created": "2022-12-14T03:53:35-08:00",
          "body": "We are working to resolve the issue with playing videos that some customers are experiencing. In the meantime, downloading videos will enable them to be played locally, until this is resolved. Thanks for bearing with us."
        },
        {
          "date_created": "2022-12-14T03:23:07-08:00",
          "body": "Our team is working hard to resolve the issue that some customers are running into when trying to play videos. Apologies for the trouble with this. As a workaround for now, you can download videos in order to play them locally on your device."
        },
        {
          "date_created": "2022-12-14T02:50:48-08:00",
          "body": "Some customers are hitting issues with playing videos at the moment. Our engineers are working to resolve this issue as quickly as possible. For now, you should be able to download videos, in order to play them. Sorry for the disruption."
        },
        {
          "date_created": "2022-12-14T02:07:31-08:00",
          "body": "Some customers are having trouble playing videos currently. Our team is continuing to investigate this issue. As a workaround in the meantime, you can download videos and play them locally."
        },
        {
          "date_created": "2022-12-14T01:36:02-08:00",
          "body": "Unfortunately some of our customers are currently experiencing problems while playing videos. Our team is investigating and as soon as we have an update we will keep you posted. Apologies for the disruption in the meantime."
        },
        {
          "date_created": "2022-12-14T00:35:09-08:00",
          "body": "We’re receiving reports around trouble playing videos. We’re on the case and will provide another update once we have more details to share. We’re sorry for the inconvenience."
        }
      ]
    }
  ]
}
