{
  "status": "active",
  "date_created": "2022-05-17T14:37:04-07:00",
  "date_updated": "2022-05-17T14:37:04-07:00",
  "active_incidents": [
    {
      "id": 1095,
      "date_created": "2022-05-17T11:28:56-07:00",
      "date_updated": "2022-05-17T14:37:04-07:00",
      "title": "Some users may be experiencing trouble with search, updating user status, and other features",
      "type": "incident",
      "status": "active",
      "url": "https://status.slack.com/2022-05/a1e4bafda056a4fc",
      "services": [
        "Apps/Integrations/APIs",
        "Connections",
        "Messaging",
        "Search"
      ],
      "notes": [
        {
          "date_created": "2022-05-17T14:37:04-07:00",
          "body": "Some users may be seeing signs of improvement, but we’re still working towards a full resolution. We’ll be back with another update!"
        },
        {
          "date_created": "2022-05-17T14:01:58-07:00",
          "body": "We’re starting to see improvements, but still have some work to do. We’ll return with another update shortly."
        },
        {
          "date_created": "2022-05-17T13:39:34-07:00",
          "body": "We’re seeing signs of improvement, but we’re still monitoring the situation. We’ll confirm once the issue is fully resolved or we have another update to share."
        },
        {
          "date_created": "2022-05-17T13:05:22-07:00",
          "body": "At this time, some people may also be encountering trouble setting or clearing their user status in Slack, as well as issues related to:\r\n\r\n• Autocomplete in message input\r\n• Workspace Directory\r\n• Quick Switcher\r\n• Channel membership and Channel status\r\n• Apps lists in channels\r\n• User profile details\r\n• Integrations/API messaging\r\n\r\nWe're observing signs of recovery, and are continuing to monitor the situation. We'll be back with another update in 30 minutes."
        },
        {
          "date_created": "2022-05-17T12:27:31-07:00",
          "body": "We’re continuing to look into this, and we’ll report back with an update in 30 minutes."
        },
        {
          "date_created": "2022-05-17T11:57:35-07:00",
          "body": "We’re still actively investigating this issue, but we don’t have any new information to share at this time. Thanks for your patience as we continue to work towards a fix."
        },
        {
          "date_created": "2022-05-17T11:28:56-07:00",
          "body": "Some users may be experiencing issues with using the search function in Slack. \r\n \r\nWe're currently investigating the issue and will provide a status update once we have more information."
        }
      ]
    }
  ]
}
