{
  "status": "active",
  "date_created": "2022-12-19T14:53:13-08:00",
  "date_updated": "2022-12-19T14:53:13-08:00",
  "active_incidents": [
    {
      "id": 1166,
      "date_created": "2022-12-15T11:01:01-08:00",
      "date_updated": "2022-12-19T14:53:13-08:00",
      "title": "Messages on iOS are automatically marked as read",
      "type": "incident",
      "status": "active",
      "url": "https://status.slack.com/2022-12/4db4ec459abdd159",
      "services": [
        "Messaging"
      ],
      "notes": [
        {
          "date_created": "2022-12-19T14:53:13-08:00",
          "body": "We've identified the cause of this issue and we're rolling out a fix to all as quickly as possible. We'll report back once it is fully released."
        },
        {
          "date_created": "2022-12-16T11:33:54-08:00",
          "body": "We're continuing to work towards a fix.  We apologize for the disruption caused by this issue, and appreciate your continued patience. Please expect an update from us early next week."
        },
        {
          "date_created": "2022-12-15T16:17:54-08:00",
          "body": "We are working on a permanent fix for this issue. In the meantime, as a workaround, we've found that affected users can avoid this issue by switching back to the channel list in their iOS app prior to exiting the app. We'll be back with another update as soon as possible."
        },
        {
          "date_created": "2022-12-15T11:28:40-08:00",
          "body": "We're still investigating the issue with users experiencing some messages marked as read before reading them. While this is impacting the iOS Slack app, users will still receive unread message notifications but may not see the activity in other sessions of Slack. We don't have additional information to share just yet but we'll be back shortly with another update."
        },
        {
          "date_created": "2022-12-15T11:01:01-08:00",
          "body": "Some users may be noticing that their messages are being marked as read automatically without reading them. We're investigating the situation but have confirmed this is only impacting the iOS Slack app. We'll let you know once we have more information to share."
        }
      ]
    }
  ]
}
